[
	{
		"id": 1,
		"company": "Bestever",
		"location": "Remote",
		"position": "Founding backend engineer",
		"desc": "As a founding backend engineer of the pre-seed startup in San Francisco, I was part of a remote team that successfully raised seed funding.\n As the only backend developer in a team of five, I designed, developed, and deployed the backend for the iOS, web, and Shopify app using Golang on the Google Cloud Platform, despite having no prior experience with these technologies.",
		"date": "July 2021 - September 2021 & April 2023 - Present",
		"link": "https://bestever.ai"
	},
	{
		"id": 2,
		"company": "Akamai",
		"location": "Bangalore",
		"position": "Software engineer II",
		"desc": "1. Successfully deployed over 200 metrics for Developer experience tools used at Akamai utilizing Influx, Grafana, Cassandra, and the ELK stack while minimizing the impact on the impacted systems.\n2. Led the design and development, including both backend and frontend, as well as the growth of an internal Git auditing tool for Akamai, now utilized by over 600 users.\n3. Led an effort for complete transparency in source code metrics by designing and developing the entire pipeline for visualizing metrics from a user, supervisor, and organizational perspective.\n4. Contributed to the design of a distributed, machine learning-powered proactive monitoring application as a service for teams at Akamai.",
		"date": "July 2018 - July 2021"
	},
	{
		"id": 3,
		"company": "Tigergraph",
		"location": "San Diego",
		"position": "Query optimization intern",
		"desc": "Accelerated the release of the cost optimizer by completing several key features, from design, to development, testing, and merging with the main branch, all within 8 weeks of my internship.\n Developed features for enabling and utilizing the cost optimizer, which is currently in production.",
		"date": "June 2022 - September 2022",
		"link": "https://docs.tigergraph.com/gsql-ref/current/querying/query-optimizer/enable-cost-optimizer"
	}
]